---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotElevationMissesReference
source: html/fd4dcd7b-fae9-aab3-4df4-766256b76aa2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotElevationMissesReference Property

Spot Dimension does not lie on its reference.

## Syntax (C#)
```csharp
public static FailureDefinitionId SpotElevationMissesReference { get; }
```